#include <iostream>
#include <vector>
#include <string>
#include <cstring> 
#include <queue>
#include <utility>

using namespace std;

/*
 	现在你有一个类MAP_BASE，请编写他的子类，继承于MAP_BASE
 	可以看到map_in是一张地图，定义.是空地，#是障碍物，现在有一个的机器人想从左上角到达右下角，请在子类中写一个函数完成这件事情
 	要求：1.将机器人中心走过的路用C表示出来并输出整个地图
		  2.机器人是四向移动的，即只能向上下左右移动
      	  3.机器人走过的路线为所有可行的路线中最短的
	
	注意：答案不唯一，只要输出一种答案就可
	加分条件：现实中机器人是有大小的，不可能完全让中心靠墙移动，现在假设机器人需要3x3的空地才能安全移动，请给出能让机器人安全移动的路径

	示例：

	#############################	#############################			#############################
	#..............###..........#	#.C............###..........#			#.C............###..........#
	#........###................#	#.C......###................#			#.C......###................#
	#.........................###	#.C.......................###			#.C.......................###	
	#.........................###	#.CCCCCCCCCCCCCCCCCC......###			#.C.......................###
	#....................########	#..................C.########			#.C..................########
	#.....#####.................#	#.....#####........C........#			#.C...#####.................#
	#...........................#	#..................CCCCCCCC.#			#.CCCCCCCCCCCCCCCCCCCCCCCCC.#
	#...........................#	#...........................#			#...........................#
	#############################中	#############################是安全的而	 #############################是不安全的因为通过了2x2的空地
	同时
	#############################	           #############################
	#.C............###..........#	           #.C............###..........#
	#.C......###................#	           #.C......###................#
	#.C.......................###	           #.C.......................###	
	#.CCCCCCCCCCCCCC..........###	           #.CCCCCCCCCCCC.CCCCC......###
	#..............C.....########	           #............C.C...C.########
	#.....#####....C............#	           #.....#####..C.C...C........#
	#..............CCCCCCCCCCCC.#	           #............CCC...CCCCCCCC.#
	#...........................#			   #...........................#
	#############################也是可行的而	#############################是不可行的因为这不是最短路

*/
class MAP_BASE
{
	public:
		MAP_BASE()
		{
			map_in = { //14*71
	        "#######################################################################",
	        "#.............................................######...........##.....#",
	        "#...........#############........................######.......#########",
	        "#...........#####...........................###...####.......##########",
	        "##.............##.............#######.................................#",
	        "###...................................................................#",
	        "#.........####................######.......................####.......#",
	        "#..........##.........#.##...................######...................#",
	        "#.....................................................................#",
	        "#.............................##................................#######",
	        "#.....................................................................#",
	        "##########.............#######..########......#########...............#",
	        "#...............................###############.......................#",
	        "#######################################################################"
			};
			std::memset(visit, false, sizeof(visit));
		}
		
		void print()
		{
			for (const auto& line : map_in)
		        std::cout << line << '\n';
		}
	protected:
		std::vector<std::string> map_in;
		bool visit[100][100];
};

/**
*在map_in中将'.'替换成'C'表示机器人的路径。将最终的结果像示例里那样输出出来
*
* 提示：
* (1) 没有思路的同学可以先去了解一下深度优先搜索算法和广度优先搜索算法，思考应该用哪种方法。
* (2) 考虑使用队列queue数据结构
*
* 考点：
* (1) 类的使用。
* (2) 搜索算法。
*/

//IMPLEMENT YOUR CODE HERE

class MAP : public MAP_BASE{
	public:
		void bfs(const pair<int ,int> &start,const pair<int ,int> &end){   //起点终点
			int dirs[4][2] = {{-1,0},{0,1},{1,0},{0,-1}};  //定义偏移量
			//定义父节点，实现路径记录
			vector<vector<pair<int,int>>> parent(14,vector<pair<int,int>>(71,{-1,-1})) ;//定义，顺带初始化
			if(map_in[start.first][start.second] == '#' || map_in[end.first][end.second] == '#') { //特判起点或终点为障碍物
				cout << "起点或终点为障碍" << endl;
				return;
			}
			queue<pair<int,int>> q;  //定义队列
			q.push(start);
			visit[start.first][start.second] = true; //起点入队并标记
			while(!q.empty()) {
				int size = q.size();
				bool for_m = false;
				for(int i = 0;i < size;i++){ //遍历每一层节点
					pair<int,int> curr = q.front(); q.pop();
					if(curr == end) { //到终点了
						for_m = true;
						break;
					}
					int x = curr.first , y = curr.second;
					for(auto &dir : dirs){  //遍历上下左右四个方向
						int xx = x + dir[0];
						int yy = y + dir[1];
						//边界检查：
						if(xx >= 1 && xx < 13 && yy >= 1 && yy < 70 && visit[xx][yy] == false && map_in[xx][yy] == '.'){
							bool is = true;
							for(int i = -1;i < 2;i++){ //判断3X3空间
								for(int j = -1;j < 2;j++){
									if(map_in[xx+i][yy+j] == '#') is = false;
								}
							}
							if(is) {
								q.push({xx,yy}) ; visit[xx][yy] = true;
								parent[xx][yy] = {x,y};
							}
						}
					}
				}
				if(for_m) break;  //到达终点 退出while循环
			}
			queue<pair<int,int>> path;  //定义path队列，实现从终点到起点的路径还原
			path.push(end);
			int par_x = end.first , par_y = end.second;
			while(parent[par_x][par_y] != pair<int,int>{-1,-1}){
				path.push(parent[par_x][par_y]);
				auto s = parent[par_x][par_y];
				par_x = s.first , par_y = s.second;
			} //路径记录完毕
			while(!path.empty()){ //根据path的记录还原路径
				pair<int,int> curr = path.front();path.pop();
				map_in[curr.first][curr.second] = 'C';
			}
		}
};

int main(){
	MAP_BASE a;
	MAP b;
	b.bfs(pair<int,int> {2,2},pair<int,int> {11,68});
	b.print();
	return 0;
}